package com.jsu.zcl.dao;
import java.sql.Connection;
import java.sql.PreparedStatement;
import java.sql.ResultSet;
import java.sql.SQLException;
import java.util.ArrayList;
import java.util.Random;
import java.util.Vector;
import javax.swing.JOptionPane;

import com.jsu.zcl.dbc.DatabaseConnectionSql;
public class PackageDataOperate {
    public static int getNum(int start,int end) {//随机返回返回指定范围间的整数
    	//Math.random()随机返回0.0至1.0之间的数
        return (int)(Math.random()*(end-start+1)+start);
    }
    private static String city[]= {
    		"北京市辖区", "北京市辖县", 
    		"天津市辖区", "天津市辖县",
    		"安徽安庆市", "安徽蚌埠市", "安徽亳州市", "安徽巢湖市", "安徽池州市", "安徽滁州市", "安徽阜阳市", "安徽合肥市", "安徽淮北市", "安徽淮南市", "安徽黄山市", "安徽六安市", "安徽马鞍山市", "安徽宿州市", "安徽铜陵市", "安徽芜湖市", "安徽宣城市", 
    		"澳门", 
    		"香港",
    		"福建福州市", "福建龙岩市", "福建南平市", "福建宁德市", "福建莆田市", "福建泉州市", "福建厦门市", "福建漳州市",
    		"甘肃白银市", "甘肃定西市", "甘肃甘南藏族自治州", "甘肃嘉峪关市", "甘肃金昌市", "甘肃酒泉市", "甘肃兰州市", "甘肃临夏回族自治州", "甘肃陇南市", "甘肃平凉市", "甘肃庆阳市", "甘肃天水市", "甘肃武威市", "甘肃张掖市",
    		"广东潮州市", "广东东莞市", "广东佛山市", "广东广州市", "广东河源市", "广东惠州市", "广东江门市", "广东揭阳市", "广东茂名市", "广东梅州市", "广东清远市", "广东汕头市", "广东汕尾市", "广东韶关市", "广东深圳市", "广东阳江市", "广东云浮市", "广东湛江市", "广东肇庆市", "广东中山市", "广东珠海市",
    		"广西百色市", "广西北海市", "广西崇左市", "广西防城港市", "广西贵港市", "广西桂林市", "广西河池市", "广西贺州市", "广西来宾市", "广西柳州市", "广西南宁市", "广西钦州市", "广西梧州市", "广西玉林市",
    		"贵州安顺市", "贵州毕节地区", "贵州贵阳市", "贵州六盘水市", "贵州黔东南苗族侗族自治州", "贵州黔南布依族苗族自治州", "贵州黔西南布依族苗族自治州", "贵州铜仁地区", "贵州遵义市",
    		"海南海口市", "海南三亚市", "海南省直辖县级行政区划",
    		"河北保定市", "河北沧州市", "河北承德市", "河北邯郸市", "河北衡水市", "河北廊坊市", "河北秦皇岛市", "河北石家庄市", "河北唐山市", "河北邢台市", "河北张家口市",
    		"河南安阳市", "河南鹤壁市", "河南焦作市", "河南开封市", "河南洛阳市", "河南漯河市", "河南南阳市", "河南平顶山市", "河南濮阳市", "河南三门峡市", "河南商丘市", "河南新乡市", "河南信阳市", "河南许昌市", "河南郑州市", "河南周口市", "河南驻马店市",
    		"黑龙江大庆市", "黑龙江大兴安岭地区", "黑龙江哈尔滨市", "黑龙江鹤岗市", "黑龙江黑河市", "黑龙江鸡西市", "黑龙江佳木斯市", "黑龙江牡丹江市", "黑龙江七台河市", "黑龙江齐齐哈尔市", "黑龙江双鸭山市", "黑龙江绥化市", "黑龙江伊春市",
    		"湖北鄂州市", "湖北恩施土家族苗族自治州", "湖北黄冈市", "湖北黄石市", "湖北荆门市", "湖北荆州市", "湖北十堰市", "湖北随州市", "湖北武汉市", "湖北咸宁市", "湖北襄樊市", "湖北孝感市", "湖北宜昌市",
            "湖南长沙市", "湖南常德市", "湖南郴州市", "湖南衡阳市", "湖南怀化市", "湖南娄底市", "湖南邵阳市", "湖南湘潭市", "湖南湘西土家族苗族自治州", "湖南益阳市", "湖南永州市", "湖南岳阳市", "湖南张家界市", "湖南株洲市",
			"吉林白城市", "吉林白山市", "吉林长春市", "吉林吉林市", "吉林辽源市", "吉林四平市", "吉林松原市", "吉林通化市", "吉林延边朝鲜族自治州",
            "江苏常州市", "江苏淮安市", "江苏连云港市", "江苏南京市", "江苏南通市", "江苏苏州市", "江苏宿迁市", "江苏泰州市", "江苏无锡市", "江苏徐州市", "江苏盐城市", "江苏扬州市", "江苏镇江市",
            "江西抚州市", "江西赣州市", "江西吉安市", "江西景德镇市", "江西九江市", "江西南昌市", "江西萍乡市", "江西上饶市", "江西新余市", "江西宜春市", "江西鹰潭市",
            "辽宁鞍山市", "辽宁本溪市", "辽宁朝阳市", "辽宁大连市", "辽宁丹东市", "辽宁抚顺市", "辽宁阜新市", "辽宁葫芦岛市", "辽宁锦州市", "辽宁辽阳市", "辽宁盘锦市", "辽宁沈阳市", "辽宁铁岭市", "辽宁营口市",
            "内蒙古阿拉善盟", "内蒙古巴彦淖尔市", "内蒙古包头市", "内蒙古赤峰市", "内蒙古鄂尔多斯市", "内蒙古呼和浩特市", "内蒙古呼伦贝尔市", "内蒙古通辽市", "内蒙古乌海市", "内蒙古乌兰察布市", "内蒙古锡林郭勒盟", "内蒙古兴安盟",
            "宁夏固原市", "宁夏石嘴山市", "宁夏吴忠市", "宁夏银川市", "宁夏中卫市",
            "青海果洛藏族自治州", "青海海北藏族自治州", "青海海东地区", "青海海南藏族自治州", "青海海西蒙古族藏族自治州", "青海黄南藏族自治州", "青海西宁市", "青海玉树藏族自治州",
            "山东滨州市", "山东德州市", "山东东营市", "山东菏泽市", "山东济南市", "山东济宁市", "山东莱芜市", "山东聊城市", "山东临沂市", "山东青岛市", "山东日照市", "山东泰安市", "山东威海市", "山东潍坊市", "山东烟台市", "山东枣庄市", "山东淄博市",
            "山西长治市", "山西大同市", "山西晋城市", "山西晋中市", "山西临汾市", "山西吕梁市", "山西朔州市", "山西太原市", "山西忻州市", "山西阳泉市", "山西运城市",
            "陕西安康市", "陕西宝鸡市", "陕西汉中市", "陕西商洛市", "陕西铜川市", "陕西渭南市", "陕西西安市", "陕西咸阳市", "陕西延安市", "陕西榆林市",
            "四川阿坝藏族羌族自治州", "四川巴中市", "四川成都市", "四川达州市", "四川德阳市", "四川甘孜藏族自治州", "四川广安市", "四川广元市", "四川乐山市", "四川凉山彝族自治州", "四川泸州市", "四川眉山市", "四川绵阳市", "四川内江市", "四川南充市", "四川攀枝花市", "四川遂宁市", "四川雅安市", "四川宜宾市", "四川资阳市", "四川自贡市",
            "西藏阿里地区", "西藏昌都地区", "西藏拉萨市", "西藏林芝地区", "西藏那曲地区", "西藏日喀则地区", "西藏山南地区",
            "新疆阿克苏地区", "新疆阿勒泰地区", "新疆巴音郭楞蒙古自治州", "新疆博尔塔拉蒙古自治州", "新疆昌吉回族自治州", "新疆哈密地区", "新疆和田地区", "新疆喀什地区", "新疆克拉玛依市", "新疆克孜勒苏柯尔克孜自治州", "新疆塔城地区", "新疆吐鲁番地区", "新疆乌鲁木齐市", "新疆伊犁哈萨克自治州", "新疆自治区直辖县级行政区划",
            "云南保山市", "云南楚雄彝族自治州", "云南大理白族自治州", "云南德宏傣族景颇族自治州", "云南迪庆藏族自治州", "云南红河哈尼族彝族自治州", "云南昆明市", "云南丽江市", "云南临沧市", "云南怒江僳僳族自治州", "云南普洱市", "云南曲靖市", "云南文山壮族苗族自治州", "云南西双版纳傣族自治州", "云南玉溪市", "云南昭通市",
            "浙江杭州市", "浙江湖州市", "浙江嘉兴市", "浙江金华市", "浙江丽水市", "浙江宁波市", "浙江衢州市", "浙江绍兴市", "浙江台州市", "浙江温州市", "浙江舟山市",
            "重庆市辖区", "重庆市辖县", "重庆县级市",
          	"台湾台北市", "台湾高雄市", "台湾基隆市", "台湾台中市", "台湾台南市", "台湾新竹市", "台湾嘉义市",
    		};
    public static  String getCity1() {//随机获得发货地址
    	Random c1 = new Random();
    	return city[c1.nextInt(300)];
    }
    public static  String getCity2() {//随机获得收货地址
    	Random c2 = new Random();
    	return city[c2.nextInt(300)];
    }
    //随机返回运单号
    public static StringBuilder getStuno() {//不使用String，因为需要大量拼接字符串
    	StringBuilder id=new StringBuilder("20210110");//编号号前8位相同
    	StringBuilder id1=new StringBuilder(String.valueOf(getNum(1,10000)));//随机取后5位
    	if(id1.length()==1) {
    		id1=id1.insert(0, "0000");//如果是1位数，前面增加2个0
    		id=id.append(id1);//前4位与后5位拼接成编号
    	}else if(id1.length()==2) {
    		id1=id1.insert(0, "000");//如果是2位数，前面增加1个0
    		id=id.append(id1);
    	}else if(id1.length()==3) {
    		id1=id1.insert(0, "00");//如果是3位数，前面增加1个0
    		id=id.append(id1);
    	}else if(id1.length()==4) {
    		id1=id1.insert(0, "0");//如果是4位数，前面增加1个0
    		id=id.append(id1);
    	}else {
    		id=id.append(id1);
    	}
    	return id;
    }
    /**
     * 取得指定sql查询语句的记录
     * @param sql 查询语句
     * @return 查询语句的结果集，类型为Vector嵌套集合，用于填充DefaultTableModel数据模型
     */
    public static Vector<Vector> getSelectAll(String sql){
    	Vector<Vector> rows=new Vector<Vector>();//定义要返回的所有记录集合
    	DatabaseConnectionSql dbcs=new DatabaseConnectionSql();//使用1中定义的连接数据库的类
    	try(Connection conn=dbcs.getConnection();//获取数据库接
    		PreparedStatement pstmt=conn.prepareStatement(sql);){//实例化PreparedStatement
    		ResultSet rs=pstmt.executeQuery();//执行查询语句，结果放到数据集中
    		while(rs.next()) {//遍历数据集
    			Vector row=new Vector();//定义行数据
    			row.add(rs.getString(1));//获取第一个字段运单号
    			row.add(rs.getString(2));//获取第二个字段发货地址
    			row.add(rs.getString(3));//获取第三个字段收货地址
    			row.add(rs.getInt(4));//获取第四个字段运费
    			rows.add(row);//将行数据添加到记录集合中
    		}
    	}catch(SQLException e) {
    		e.printStackTrace();
    	}
    	return rows;//返回所有行数据
    }
    public static void main(String[] args) {
    	addpackage();
    }
    public static void addpackage() {//增加包裹数据
    	DatabaseConnectionSql dbcs=new DatabaseConnectionSql();//使用1中定义的连接数据库的类
    	String sql="insert into package(id,ad1,ad2,price) values(?,?,?,?)";//使用占位符定义插入语句
    	try(Connection conn=dbcs.getConnection();//获取数据库接
    		PreparedStatement pstmt=conn.prepareStatement(sql);){//实例化PreparedStatement
        	ArrayList<String> alist=new ArrayList<String>();//定义集合
    		for(int i=1;i<=10000;) {
    			String id=getStuno().toString();//随机获取编号
    			if(!alist.contains(id)) {//判断运单号是否唯一
    				alist.add(id);//将学号加入集合
    				String ad1=getCity1();//随机获取发货地址
    				String ad2=getCity2();//随机获取收货地址
    				int price=getNum(12, 72);//随机获取运费
    				pstmt.setString(1, id);//定义第1个占位符的内容
    	    		pstmt.setString(2, ad1);//定义第2个占位符的内容
    	    		pstmt.setString(3, ad2);//定义第3个占位符的内容
    	    		pstmt.setInt(4, price);
    	    		pstmt.addBatch();//加入批处理等待执行
    				i++;//编号唯一唯一，循环继续往下执行
    			}
    		}
    		pstmt.executeBatch();//批量执行插入操作
    		JOptionPane.showMessageDialog(null, "增加成功！");
    	}catch(SQLException e) {
    		e.printStackTrace();
    	}
    }
}

